src/main/resources/docsigned2.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:cz:cnb:pnm">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:vlozeniProfilu urn:id="signedData">
         <urn:banka>0710</urn:banka>
         <urn:tc1>420000000333</urn:tc1>
         <urn:cu1>CZ4307100000190000000123</urn:cu1>
         <urn:nazev>PePa</urn:nazev>
         <!--Optional:-->
        <urn:t0>2022-03-24T08:08:00.000+02:00</urn:t0>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature"><ds:SignedInfo Id="SignedInfo"><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#signedData"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>TvHJPInoXQa87EMyFP/kGKKggSrQ0iCpaUGs+F0S6ls=</ds:DigestValue></ds:Reference><ds:Reference Id="SignedProperties-Reference" Type="http://uri.etsi.org/01903#SignedProperties" URI="#SignedProperties"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>b55Y++3eLwT7/DWOsiYmqNW0iyPs+J/M4MYd24kGKFA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue Id="SignatureValue">uBL+THnt4uLmIOX0+0jiWgKluJIPICLaYUQVsVtlcJvKIv37fKFdgI3DgXDXzLK7
NT7KDoEJjJ0Ip2KGaCDKxAuTltnbc3R8ZSD12+6bSLnT6omd1m9Px4uIZYHmkV+l
2A8+Zn/640CLmicA5QABIY5xq9j9CS7Ph04umAtHBs9l8bo4Odhj5iqQiRdL6db5
ZL4o5HZVjUgA1ERaR3qFs1jpKutrswjHCNUX5WfS6Fd53bjaOe9kuUqBl674CjLj
AX9clCfVmeJZfE+jlXW/kedyuoh1c4tP2GgByfVvLcOZKCKWuOEBUTM5cPLI/PN/
k/FhBayu4d0qTkwvIRL0SlhhBEl6OA+j9+N2yMNBFjgFBn1O9aEvYt5dfIs9CXvY
tU++KD7azUAj0yeh/qUZ/uD8ipqGll4WzzPqmkFTHVHRWnFr098Ysdyl0bPqTRcQ
01ySJwuxnLpmOp3s9VFZo5tniTyC0I1qFZquC9hBeWW7RobC1C/CQn6jjou6G3wJ
2YhJeeHptghXdfCsJW/eDeKzod/XajNBGNNJW9fT7utX4wYBbcHxjIPvvUXsameM
MyDrst+Qu1lwz9UD8Cc0ul5Hx8NrBGxbCwNT8xGFm5OA7j3pA2eqIxei1Wz8Fp4a
VZcjJYYPWQB1yiQ+cO1qNRET0SUZ2aczrTIdEV2rYx8=</ds:SignatureValue><ds:KeyInfo Id="KeyInfo"><ds:X509Data><ds:X509Certificate>MIIF7zCCA9egAwIBAgIUfIHZuWRdj9BF8mBM97I/aTBlQPAwDQYJKoZIhvcNAQEL
BQAwgYYxCzAJBgNVBAYTAkNaMQ4wDAYDVQQIDAVDemVjaDENMAsGA1UEBwwEUHJh
ZzEhMB8GA1UECgwYSW50ZXJuZXQgV2lkZ2l0cyBQdHkgTHRkMQ4wDAYDVQQDDAVE
YXZpZDElMCMGCSqGSIb3DQEJARYWREx1a2FzLkRhdmlkQGdtYWlsLmNvbTAeFw0y
MzAxMDQwNzU5MTZaFw0yNDAxMDQwNzU5MTZaMIGGMQswCQYDVQQGEwJDWjEOMAwG
A1UECAwFQ3plY2gxDTALBgNVBAcMBFByYWcxITAfBgNVBAoMGEludGVybmV0IFdp
ZGdpdHMgUHR5IEx0ZDEOMAwGA1UEAwwFRGF2aWQxJTAjBgkqhkiG9w0BCQEWFkRM
dWthcy5EYXZpZEBnbWFpbC5jb20wggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIK
AoICAQDf+BXtAnGd7lOnHkgcMAVFKS8FiFJO3vYFs0htpnPG+HjBUBN99+eMLFiK
R76oGS7chvI6jFO2DnYa2sHWXE8tbX/9C3+6usbJ3ZxH2uBmKKMjiPUW2FFKWU5D
MKoQXFGryR6h4jzyolCZGY4/KyShYgma6Jlbz9iGwM57DrBaJkfAtzVZkBmqShKD
MQm1SyCWeoMwUrt9QnBeJmYamt+CCbNtgQgZavspdqYKSjUkBEsG7A/glrd9B8Vb
6pB1LxzsJ2X7NlUG+ebWCZtQ/dR+1Ci+pkisxBTWdy2hN8KMF/VYw/drRICwefSO
TpGqjuhoczgav1F12IASUUFJpLPATTKhQlPQaQrfnjvlO/jONFezD8/Iw9XMfQNG
eu9NoDZSb8X1Pu5ecuErk/5aqy1Ua1eycUxLwSPwsSoaT3yW6ejFGcdHoHjSXhMG
gs3HyBRO6NVweIXr/nCg1J3+x6+mpGU9xzJUxQj6YyQD3OZ7i/QJg1B7eTKpFvJm
laZawz/ctmuVPqKzQ86DKAQ0cofMJOHYTOh4MFqpbD2rDShI1qVdYyuTSVdzrcl4
fVYTY6CEuYQ/rgrJ7OiAbmxxl5AFC9GoJuEJiFBx7RquxdLqrh20+413I2bi1DUO
Bft4T+sRRIarsjDqmOEICVU1juxG14Hpq/S1FRSzT8bVX9cjsQIDAQABo1MwUTAd
BgNVHQ4EFgQUVxhbQt201rWsbJkd54QLLB+iapUwHwYDVR0jBBgwFoAUVxhbQt20
1rWsbJkd54QLLB+iapUwDwYDVR0TAQH/BAUwAwEB/zANBgkqhkiG9w0BAQsFAAOC
AgEAe4eX6tJEL0ENVg5LLO08/mLT+/prNl7hScDu/6dGnayEzx88RdUHUL0Ov0F7
ETJK7hIuu4Gk1WYPMSlb2B5WArZ/iJIQ5R5Dz/X7+1Iu8RcKss67yXvn8umxhIu6
dhOgMk+u+NoQMeyIPNGFIOqYGe/PeILQCs4BnnKJHoWTX+U3xpUiHZ6kenenCrgz
T9fiDwcYpIZwkoH1cCmC0zj4/1bTq/RaO1/G1npeLSwI9JdXoB2PAcd3z9koKn8y
WFsvrzURDx3oiqPfBw3CG4Ql8bpuMpKQqfavE/g9QXQwLZ97/ALsEecldJTfNnB8
IM8H1Tm5wOb0Ji5wvmy1exAUDCxwyL0M3G+q6T6CYCPmI02z2evOPAKeNKbn2NtA
XDkr/92GUAK0ZTiK4q3Wugk7tALq8kqOwnrKJ/30VIVKtwe6UUTQXjzkPffw1ClG
CrTGey4Jd7O4Nz4pQfweK0YGh69TlCOjfTfR6TfXsuK6m0phkTEQ5PCHktCY931c
xAOgGY9yVF4bWIFrcNg6ql/DyADHzRwXu87adFzhr6HYKEHhyFHN30TUA/xaCddF
LbnBroz5N9Vw6v7V/k9/gd2TvktEIpx4eldxWcwauCTUeksDpQHG2gIt1vdKVlT7
cXy30XI9hRwEaM5gqOVgTGju2p21JtVttJiC8LgCs9BD9ik=</ds:X509Certificate></ds:X509Data></ds:KeyInfo><ds:Object><xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" Target="#Signature"><xades:SignedProperties Id="SignedProperties"><xades:SignedSignatureProperties><xades:SigningTime>2023-01-04T09:37:54+01:00</xades:SigningTime><xades:SigningCertificate><xades:Cert><xades:CertDigest><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>Aib7bIQiSPj9u17y0YYgXuJ66AtqI6iub2HAxLTmTf8=</ds:DigestValue></xades:CertDigest><xades:IssuerSerial><ds:X509IssuerName>EMAIL=DLukas.David@gmail.com,CN=David,O=Internet Widgits Pty Ltd,L=Prag,ST=Czech,C=CZ</ds:X509IssuerName><ds:X509SerialNumber>710810618164460223809319938523305389930037199088</ds:X509SerialNumber></xades:IssuerSerial></xades:Cert></xades:SigningCertificate></xades:SignedSignatureProperties></xades:SignedProperties></xades:QualifyingProperties></ds:Object></ds:Signature></urn:vlozeniProfilu>
</soapenv:Body>
</soapenv:Envelope>